import React from 'react';
import './terms_of_use.sass';
import {Link} from 'react-router-dom';


const TermsOfUse = () => {
    return (
        <>
        
        <div className="terms-of-use">
            <div className="terms-of-use__document">
                <h1>ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ </h1>
                    <p>г. Краснодар</p>
                    <p>«06» июля 2020г.</p>
                <h2>1. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
                    <p><strong>1.1. </strong>Настоящее Пользовательское соглашение (далее – Соглашение) относится к сайту Интернет-магазина «AmDelivery», расположенному 
                    по адресу amdelivery.ru, и ко всем соответствующим сайтам, связанным с сайтом www.amdelivery.ru. 
                    </p>
                    <p><strong>1.2. </strong>Сайт Интернет-магазина « AmDelivery»  (далее – Сайт) является собственностью ИП Неделин Дмитрий Александрович
                    </p>
                    <p><strong>1.3.	</strong>Настоящее Соглашение регулирует отношения между Администрацией сайта Интернет-магазина «AmDelivery»  (далее – Администрация сайта) и Пользователем данного Сайта.
                    </p>
                    <p><strong>1.4. </strong>Администрация сайта оставляет за собой право в любое время изменять, добавлять или удалять пункты настоящего Соглашения без уведомления Пользователя.
                    </p>
                    <p><strong>1.5. </strong>Продолжение использования Сайта Пользователем означает принятие Соглашения и изменений, внесенных в настоящее Соглашение.
                    </p>
                    <p><strong>1.6. </strong>Пользователь несет персональную ответственность за проверку настоящего Соглашения на наличие изменений в нем.
                    </p>
                <h2>2.	ОПРЕДЕЛЕНИЯ ТЕРМИНОВ</h2>
                    <p><strong>2.1.	</strong>Перечисленные ниже термины имеют для целей настоящего Соглашения следующее значение:
                    </p>
                    <p><strong>2.1.1 </strong><strong>«AmDelivery»</strong> – Интернет-магазин, расположенный на доменном имени www.amdelivery.ru, осуществляющий свою деятельность посредством Интернет-ресурса и сопутствующих ему сервисов.
                    </p>
                    <p><strong>2.1.2. </strong>Интернет-магазин – сайт, содержащий информацию о Товарах, Продавце, позволяющий осуществить выбор, заказ и (или) приобретение Товара. 
                    </p>
                    <p><strong>2.1.3. </strong>Администрация сайта Интернет-магазина – уполномоченные сотрудники на управления Сайтом, действующие от имени<strong>AmDelivery</strong>.
                    </p>
                    <p><strong>2.1.4. </strong>Пользователь сайта Интернет-магазина (далее  Пользователь) – лицо, имеющее доступ к Сайту, посредством сети Интернет и использующее Сайт.
                    </p>
                    <p><strong>2.1.5. </strong>Содержание сайта Интернет-магазина (далее – Содержание) - охраняемые результаты интеллектуальной деятельности, включая тексты литературных произведений, их названия, предисловия, аннотации, статьи, иллюстрации, обложки, музыкальные произведения с текстом или без текста, графические, текстовые, фотографические, производные, составные и иные произведения, пользовательские интерфейсы, визуальные интерфейсы, названия товарных знаков, логотипы, программы для ЭВМ, базы данных, а также дизайн, структура, выбор, координация, внешний вид, общий стиль и расположение данного Содержания, входящего в состав Сайта и другие объекты интеллектуальной собственности все вместе и/или по отдельности, содержащиеся на сайте Интернет-магазина.
                    </p>
                <h2>3.	ПРЕДМЕТ СОГЛАШЕНИЯ</h2>
                    <p><strong>3.1. </strong>Предметом настоящего Соглашения является предоставление Пользователю Интернет-магазина доступа к содержащимся на Сайте Товарам и оказываемым услугам.
                    </p>
                    <p><strong>3.1.1. </strong>Интернет-магазин предоставляет Пользователю следующие виды услуг (сервисов):
                    </p>
                        <ul>
                            <li>доступ к электронному контенту на  бесплатной основе, с правом воспользоваться платными услугами за фиксированную стоимость. </li>
                            <li>доступ к средствам поиска и навигации Интернет-магазина;</li>
                            <li>предоставление Пользователю возможности размещения сообщений, комментариев, рецензий Пользователей, выставления оценок контенту Интернет-магазина;</li>
                            <li>доступ к информации о Товаре и к информации о приобретении Товара на  бесплатной основе;</li>
                            <li>иные виды услуг (сервисов), реализуемые на страницах Интернет-магазина.</li>
                        </ul>
                    <p><strong>3.1.2. </strong>Под действие настоящего Соглашения подпадают все существующие (реально функционирующие) на данный момент услуги (сервисы) Интернет-магазина, а также любые их последующие модификации и появляющиеся в дальнейшем дополнительные услуги (сервисы) Интернет-магазина.
                    </p>
                    <p><strong>3.2. </strong>Доступ к Интернет-магазину предоставляется на безвозмездной основе. 
                    </p>
                    <p><strong>3.3. </strong>Настоящее Соглашение является публичной офертой. Получая доступ к Сайту Пользователь считается присоединившимся к настоящему Соглашению. 
                    </p>
                    <p><strong>3.4. </strong>Использование материалов и сервисов Сайта регулируется нормами действующего законодательства Российской Федерации
                    </p>
                <h2>4.	ПРАВА И ОБЯЗАННОСТИ СТОРОН</h2>
                    <p><strong>4.1. Администрация сайта вправе:</strong>
                    </p>
                    <p><strong>4.1.1. </strong>Изменять правила пользования Сайтом, а также изменять содержание данного Сайта. Изменения вступают в силу с момента публикации новой редакции Соглашения на Сайте.
                    </p>
                    <p><strong>4.1.2. </strong>Ограничить доступ к Сайту в случае нарушения Пользователем условий настоящего Соглашения.
                    </p>
                    <p><strong>4.2. Пользователь вправе: </strong>
                    </p>
                    <p><strong>4.2.1. </strong>Получить доступ к использованию Сайта после соблюдения требований о регистрации.
                    </p>
                    <p><strong>4.2.2. </strong>Пользоваться всеми имеющимися на Сайте услугами, а также приобретать любые Товары, предлагаемые на Сайте.
                    </p>
                    <p><strong>4.2.3. </strong>Задавать любые вопросы, относящиеся к услугам Интернет-магазина по реквизитам, которые находятся в разделе Сайта «Контакты».
                    </p>
                    <p><strong>4.2.4. </strong>Пользоваться Сайтом исключительно в целях и порядке, предусмотренных Соглашением и не запрещенных законодательством Российской Федерации.
                    </p>
                    <p><strong>4.3. Пользователь Сайта обязуется:</strong>
                    </p>
                    <p><strong>4.3.1. </strong>Предоставлять по запросу Администрации сайта дополнительную информацию, которая имеет непосредственное отношение к предоставляемым услугам данного Сайта.
                    </p>
                    <p><strong>4.3.2. </strong>Соблюдать имущественные и неимущественные права авторов и иных правообладателей при использовании Сайта.
                    </p>
                    <p><strong>4.3.3. </strong>Не предпринимать действий, которые могут рассматриваться как нарушающие нормальную работу Сайта.
                    </p>
                    <p><strong>4.3.4. </strong>Не распространять с использованием Сайта любую конфиденциальную и охраняемую законодательством Российской Федерации информацию о физических либо юридических лицах. 
                    </p>
                    <p><strong>4.3.5. </strong>Избегать любых действий, в результате которых может быть нарушена конфиденциальность охраняемой законодательством Российской Федерации информации.
                    </p>
                    <p><strong>4.3.6. </strong>Не предпринимать действий, которые могут рассматриваться как нарушающие нормальную работу Сайта.
                    </p>
                    <p><strong>4.3.7. </strong> Не использовать сервисы сайта Интернет-магазина с целью: 
                    </p>
                        <ol>
                            <li> загрузки контента, который является незаконным, нарушает любые права третьих лиц; пропагандирует насилие, жестокость, ненависть и (или) дискриминацию по расовому, национальному, половому, религиозному, социальному признакам; содержит недостоверные сведения и (или) оскорбления в адрес конкретных лиц, организаций, органов власти. 
                            </li>
                            <li> побуждения к совершению противоправных действий, а также содействия лицам, действия которых направлены на нарушение ограничений и запретов, действующих на территории Российской Федерации.</li>
                            <li> нарушения прав несовершеннолетних лиц и (или) причинение им вреда в любой форме. </li>
                            <li> ущемления прав меньшинств.</li>
                            <li> представления себя за другого человека или представителя организации и (или) сообщества без достаточных на то прав, в том числе за сотрудников данного Интернет-магазина</li>
                            <li> введения в заблуждение относительно свойств и характеристик какого-либо Товара из каталога Интернет-магазина, размещенного на Сайте.</li>
                            <li> некорректного сравнения Товара, а также формирования негативного отношения к лицам, (не) пользующимся определенными Товарами, или осуждения таких лиц</li>
                        </ol>
                    <p><strong>4.4. Пользователю запрещается:</strong>
                    </p>
                    <p><strong>4.4.1. </strong>Использовать любые устройства, программы, процедуры, алгоритмы и методы, автоматические устройства или эквивалентные ручные процессы для доступа, приобретения, копирования или отслеживания содержания Сайта данного Интернет-магазина;
                    4.4.2. Нарушать надлежащее функционирование Сайта;
                    </p>
                    <p><strong>4.4.1. </strong>Использовать любые устройства, программы, процедуры, алгоритмы и методы, автоматические устройства или эквивалентные ручные процессы для доступа, приобретения, копирования или отслеживания содержания Сайта данного Интернет-магазина;
                    </p>
                    <p><strong>4.4.2. </strong>Нарушать надлежащее функционирование Сайта;
                    </p>
                    <p><strong>4.4.3. </strong>Любым способом обходить навигационную структуру Сайта для получения или попытки получения любой информации, документов или материалов любыми средствами, которые специально не представлены сервисами данного Сайта;
                    </p>
                    <p><strong>4.4.4. </strong>Несанкционированный доступ к функциям Сайта, любым другим системам или сетям, относящимся к данному Сайту, а также к любым услугам, предлагаемым на Сайте;
                    </p>
                    <p><strong>4.4.5. </strong>Нарушать систему безопасности или аутентификации на Сайте или в любой сети, относящейся к Сайту. 
                    </p>
                    <p><strong>4.4.6. </strong>Выполнять обратный поиск, отслеживать или пытаться отслеживать любую информацию о любом другом Пользователе Сайта.
                    </p>
                    <p><strong>4.4.7. </strong>Использовать Сайт и его Содержание в любых целях, запрещенных законодательством Российской Федерации, а также подстрекать к любой незаконной деятельности или другой деятельности, нарушающей права интернет-магазина или других лиц.
                    </p>
                <h2>5.	ИСПОЛЬЗОВАНИЕ САЙТА ИНТЕРНЕТ-МАГАЗИНА</h2>  
                    <p><strong>5.1. </strong>Сайт и Содержание, входящее в состав Сайта, принадлежит и управляется Администрацией сайта. 
                    </p>   
                    <p><strong>5.2. </strong>Содержание Сайта не может быть скопировано, опубликовано, воспроизведено, передано или распространено любым способом, а также размещено в глобальной сети «Интернет» без предварительного письменного согласия Администрации сайта.
                    </p>   
                    <p><strong>5.3. </strong>Содержание Сайта защищено авторским правом, законодательством о товарных знаках, а также другими правами, связанными с интеллектуальной собственностью, и законодательством о недобросовестной конкуренции.
                    </p>  
                    <p><strong>5.4. </strong>Приобретение Товара, предлагаемого на Сайте, может потребовать создания учётной записи Пользователя. 
                    </p> 
                    <p><strong>5.5. </strong>Пользователь несет персональную ответственность за сохранение конфиденциальности информации учётной записи, включая пароль, а также за всю без исключения деятельность, которая ведётся от имени Пользователя учётной записи. 
                    </p> 
                    <p><strong>5.6. </strong>Пользователь должен незамедлительно уведомить Администрацию сайта о несанкционированном использовании его учётной записи или пароля или любом другом нарушении системы безопасности. 
                    </p> 
                    <p><strong>5.7. </strong>Администрация сайта обладает правом в одностороннем порядке аннулировать учетную запись Пользователя, если она не использовалась более <strong>12</strong> календарных месяцев подряд без уведомления Пользователя. 
                    </p> 
                    <p><strong>5.8. </strong>Настоящее Соглашение распространяет свое действия на все дополнительные положения и условия о покупке Товара и оказанию услуг, предоставляемых на Сайте. 
                    </p> 
                    <p><strong>5.9. </strong>Информация, размещаемая на Сайте не должна истолковываться как изменение настоящего Соглашения. 
                    </p> 
                    <p><strong>5.10. </strong>Администрация сайта имеет право в любое время без уведомления Пользователя вносить изменения в перечень Товаров и услуг, предлагаемых на Сайте, и (или) в цены, применимые к таким Товарам по их реализации и (или) оказываемым услугам Интернет-магазином. 
                    </p> 
                    <p><strong>5.11. </strong>Документы, указанные в пунктах <strong>5.11.1 - 5.11.4</strong> настоящего Соглашения регулируют в соответствующей части и распространяют свое действие на использование Пользователем Сайта. В настоящее Соглашение включены следующие документы: 
                    </p> 
                    <p><strong>5.11.1. </strong>Политика конфиденциальности;
                    </p> 
                    <p><strong>5.11.2. </strong>Договор купли-продажи товаров дистанционным способом;
                    </p> 
                    <p><strong>5.11.3. </strong>Заявка на оформление заказа;
                    </p> 
                    <p><strong>5.11.4. </strong>Предложения и замечания.
                    </p> 
                    <p><strong>5.12. </strong>Любой из документов, перечисленных в пункте <strong>5.11.</strong> настоящего Соглашения может подлежать обновлению. Изменения вступают в силу с момента их опубликования на Сайте.
                    </p> 
                <h2>6.	ОТВЕТСТВЕННОСТЬ</h2>
                    <p><strong>6.1. </strong>Любые убытки, которые Пользователь может понести в случае умышленного или неосторожного нарушения любого положения настоящего Соглашения, а также вследствие несанкционированного доступа к коммуникациям другого Пользователя, Администрацией сайта не возмещаются.
                    </p> 
                    <p><strong>6.2. </strong>Администрация сайта не несет ответственности за:
                    </p> 
                        <ol>
                            <li>Задержки или сбои в процессе совершения операции, возникшие вследствие непреодолимой силы, а также любого случая неполадок в телекоммуникационных, компьютерных, электрических и иных смежных системах.
                            </li>
                            <li>Действия систем переводов, банков, платежных систем и за задержки связанные с их работой.</li>
                            <li>Надлежащее функционирование Сайта, в случае, если Пользователь не имеет необходимых технических средств для его использования, а также не несет никаких обязательств по обеспечению пользователей такими средствами. </li>
                        </ol>
                <h2>7.	НАРУШЕНИЕ УСЛОВИЙ ПОЛЬЗОВАТЕЛЬСКОГО СОГЛАШЕНИЯ</h2>
                    <p><strong>7.1. </strong>Администрация сайта вправе раскрыть любую собранную о Пользователе данного Сайта информацию, если раскрытие необходимо в связи с расследованием или жалобой в отношении неправомерного использования Сайта либо для установления (идентификации) Пользователя, который может нарушать или вмешиваться в права Администрации сайта или в права других Пользователей Сайта.
                    </p> 
                    <p><strong>7.2. </strong>Администрация сайта имеет право раскрыть любую информацию о Пользователе, которую посчитает необходимой для выполнения положений действующего законодательства или судебных решений, обеспечения выполнения условий настоящего Соглашения, защиты прав или безопасности ИП Неделин Дмитрий Александрович, Пользователей.
                    </p> 
                    <p><strong>7.3. </strong>Администрация сайта имеет право раскрыть информацию о Пользователе, если действующее законодательство Российской Федерации требует или разрешает такое раскрытие.
                    </p> 
                    <p><strong>7.4. </strong>Администрация сайта вправе без предварительного уведомления Пользователя прекратить и (или) заблокировать доступ к Сайту, если Пользователь нарушил настоящее Соглашение или содержащиеся в иных документах условия пользования Сайтом, а также в случае прекращения действия Сайта либо по причине технической неполадки или проблемы.
                    </p> 
                    <p><strong>7.5. </strong>Администрация сайта не несет ответственности перед Пользователем или третьими лицами за прекращение доступа к Сайту в случае нарушения Пользователем любого положения настоящего Соглашения или иного документа, содержащего условия пользования Сайтом.
                    </p> 
                <h2>8.	РАЗРЕШЕНИЕ СПОРОВ</h2>
                    <p><strong>8.1. </strong>В случае возникновения любых разногласий или споров между Сторонами настоящего Соглашения обязательным условием до обращения в суд является предъявление претензии (письменного предложения о добровольном урегулировании спора).
                    </p> 
                    <p><strong>8.2. </strong>Получатель претензии в течение 30 календарных дней со дня ее получения, письменно уведомляет заявителя претензии о результатах рассмотрения претензии.
                    </p>
                    <p><strong>8.3. </strong>При невозможности разрешить спор в добровольном порядке любая из Сторон вправе обратиться в суд за защитой своих прав, которые предоставлены им действующим законодательством Российской Федерации.
                    </p>  
                    <p><strong>8.4. </strong>Любой иск в отношении условий использования Сайта должен быть предъявлен в течение <strong>3х</strong> календарных дней после возникновения оснований для иска, за исключением защиты авторских прав на охраняемые в соответствии с законодательством материалы Сайта. При нарушении условий данного пункта любой иск или основания для иска погашаются исковой давностью.
                    </p>
                <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
                    <p><strong>9.1. </strong>Администрация сайта не принимает встречные предложения от Пользователя относительно изменений настоящего Пользовательского соглашения. 
                    </p> 
                    <p><strong>9.2. </strong>Отзывы Пользователя, размещенные на Сайте, не являются конфиденциальной информацией и могут быть использованы Администрацией сайта без ограничений. 
                    </p> 
                    <p></p>
                    <p>Обновлено «06» июля 2020 г.</p>
            </div>
            
                <Link to="/home"><button className="terms-of-use__to-main-page">На главную</button></Link>
            
        </div>
        
        </>
        
    )
}
export default TermsOfUse;